performance/artillery-config.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Warm up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    # Ramp up phase
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up load"
    # Sustained load phase
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    # Peak load phase
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  defaults:
    headers:
      User-Agent: "Artillery Load Test"

scenarios:
  # Homepage load test
  - name: "Browse homepage"
    weight: 30
    flow:
      - get:
          url: "/"
      - think: 3
      
  # Product browsing
  - name: "Browse products"
    weight: 40
    flow:
      - get:
          url: "/products"
      - think: 2
      - get:
          url: "/products?category=clothing"
      - think: 3
      - get:
          url: "/products/1"
      - think: 5
      
  # Brand browsing
  - name: "Browse brands"
    weight: 20
    flow:
      - get:
          url: "/brands"
      - think: 2
      - get:
          url: "/brands/nike"
      - think: 4
      
  # API load test
  - name: "API calls"
    weight: 10
    flow:
      - get:
          url: "/api/products"
      - think: 1
      - get:
          url: "/api/brands"
      - think: 1
      - post:
          url: "/api/cart"
          json:
            product_id: "test-product"
            quantity: 1

# Metrics to track
metrics:
  - name: "response_time_p95"
    description: "95th percentile response time"
    
  - name: "response_time_p99"
    description: "99th percentile response time"